package functions.functionsContinued

fun main() {
    example()

    // println(flowers) - Ошибка. Переменная flowers доступна только в пределах функции example
}

fun example() {
    val flowers = 5
    println("I have $flowers flowers")
}

/**
 * 1) Переменные объявленные внутри функций доступны только внутри функции и не доступны за ее пределами
 * 2) Когда выполнение блока кода внутри функции доходит до конца, память очищается и все переменные
 *    объявленные внутри функции - удаляются
 * 3) Попытка получить значение переменной, объявленной внутри функции, за ее пределами приведет
 *    к ошибке!
 */
